Terraform output

```
Terraform planned the following actions, but then encountered a problem:

  # aws_efs_file_system.homedirs will be destroyed
  # (because resource uses count or for_each)
  - resource "aws_efs_file_system" "homedirs" {
      - arn                             = "arn:aws:elasticfilesystem:us-west-2:783616723547:file-system/fs-b25253b5" -> null
      - creation_token                  = "ded6e536cc9e07f14207cd7df6c6f666" -> null
      - dns_name                        = "fs-b25253b5.efs.us-west-2.amazonaws.com" -> null
      - encrypted                       = true -> null
      - id                              = "fs-b25253b5" -> null
      - kms_key_id                      = "arn:aws:kms:us-west-2:783616723547:key/45bb02b5-4366-4f64-a500-7bcf57c4470f" -> null
      - name                            = "hub-homedirs" -> null
      - number_of_mount_targets         = 3 -> null
      - owner_id                        = "783616723547" -> null
      - performance_mode                = "generalPurpose" -> null
      - provisioned_throughput_in_mibps = 0 -> null
      - size_in_bytes                   = [
          - {
              - value             = 1579278168064
              - value_in_ia       = 957880299520
              - value_in_standard = 621397868544
            },
        ] -> null
      - tags                            = {
          - "Name" = "hub-homedirs"
        } -> null
      - tags_all                        = {
          - "Name" = "hub-homedirs"
        } -> null
      - throughput_mode                 = "bursting" -> null
        # (2 unchanged attributes hidden)

      - lifecycle_policy {
          - transition_to_primary_storage_class = "AFTER_1_ACCESS" -> null
            # (2 unchanged attributes hidden)
        }
      - lifecycle_policy {
          - transition_to_ia                    = "AFTER_90_DAYS" -> null
            # (2 unchanged attributes hidden)
        }

      - protection {
          - replication_overwrite = "ENABLED" -> null
        }
    }

  # aws_efs_file_system.homedirs["filestore"] will be created
  + resource "aws_efs_file_system" "homedirs" {
      + arn                     = (known after apply)
      + availability_zone_id    = (known after apply)
      + availability_zone_name  = (known after apply)
      + creation_token          = (known after apply)
      + dns_name                = (known after apply)
      + encrypted               = (known after apply)
      + id                      = (known after apply)
      + kms_key_id              = (known after apply)
      + name                    = (known after apply)
      + number_of_mount_targets = (known after apply)
      + owner_id                = (known after apply)
      + performance_mode        = (known after apply)
      + size_in_bytes           = (known after apply)
      + tags                    = {
          + "Name" = "hub-homedirs"
        }
      + tags_all                = {
          + "Name" = "hub-homedirs"
        }
      + throughput_mode         = "bursting"

      + lifecycle_policy {
          + transition_to_primary_storage_class = "AFTER_1_ACCESS"
        }
      + lifecycle_policy {
          + transition_to_ia = "AFTER_90_DAYS"
        }

      + protection (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
╷
│ Error: Instance cannot be destroyed
│ 
│   on efs.tf line 42:
│   42: resource "aws_efs_file_system" "homedirs" {
│ 
│ Resource aws_efs_file_system.homedirs has lifecycle.prevent_destroy set, but the plan calls for this resource to be destroyed.
│ To avoid this error and continue with the plan, either disable lifecycle.prevent_destroy or reduce the scope of the plan using
│ the -target option.
```